**Что такое базы данных?**
Базы данных представляют собой структурированный источник данных, оптимизированный для эффективного извлечения и хранения.

* структурированный: мы должны заранее определить стратегию организации
* извлечение: возможность считывания данных
* хранение: возможность записи данных и их сохранения

**База данных** - комплекс данных (информации),
которые структурированы и взаимосвязаны
между собой.

**Что такое реляционная база данных?**
Реляционные базы данных традиционно организованы следующим образом:

* База данных содержит таблицы, представляющие отдельные сущности или объекты.
* Таблицы имеют предопределенную схему — правила, которые сообщают, как будут выглядеть данные.

Каждая таблица должна иметь столбец первичного ключа: уникальный идентификатор для этой строки.
Кроме того, каждая таблица может иметь столбец внешнего ключа: идентификатор, который связывает его с другой таблицей.

**Реляционные базы данных**(БД) имеют
табличную форму организации т.е. реализованы
в виде таблиц, связанных между собой
отношениями с помощью кодов (ключей).

![https://raw.githubusercontent.com/trisha00001/file/main/bd.png](https://raw.githubusercontent.com/trisha00001/file/main/bd.png)

**Особенности реляционных БД:**

- таблице присваивается имя, уникальное в пределах БД
каждому столбцу присваивается имя уникальное в
пределах таблицы;
- каждый столбец таблицы содержит данные одного типа
в таблице нет одинаковых строк;
- строки таблицы не имеют имен (но имеют уникальный
идентификатор).

**Таблица** представляет из себя набор столбцов.

**Столбцы** таблицы могут называть полями или
колонками, все эти слова будут использоваться
как синонимы

**Строки, записи** – тоже синонимы

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/bd1.png)

<H2>Первичный ключ (PRIMARY KEY)</H2>

**PRIMARY KEY(первичный ключ)** – это поле (или комбинация
полей), которое однозначно идентифицирует запись.

В таблице не может быть двух записей с
одинаковым значением ключа.

PRIMARY KEY должен:
- содержать уникальные значения
- не может содержать NULL значения.

*Таблица может иметь только один первичный ключ*

<H2>Могут ли эти данные быть ключом?</H2>

- фамилия

- номер и серия паспорта

- номер дома

- регистрационный номер автомобиля

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/vk.png)

<H2/>Схема БД

**Схема БД (схема)** является графическим
образом БД

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/multiple-tables.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/ts.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/t1.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/t2.png)

В нормализованной схеме таблицы спроектированы так, чтобы быть тонкими, чтобы свести к минимуму:

1. Объем повторяющейся информации
2. Количество хранимых байтов

<img src='https://github.com/podopie/DAT18NYC/blob/master/classes/img/normalized.png?raw=true' style='height: 50%; margin-left: 0;' >

<img src='https://github.com/podopie/DAT18NYC/raw/83dc789584a3349096988bbe14ffd7b87acef5e8/classes/img/erd.png' />


Показательный пример; Ниже приведена реляционная диаграмма типичной платформы электронной коммерции

Что, если бы мы спроектировали базу данных таким образом, чтобы она выглядела таким образом с одной таблицей?

<img src='https://github.com/podopie/DAT18NYC/raw/83dc789584a3349096988bbe14ffd7b87acef5e8/classes/img/denormalized.png' style='height: 50%; margin-left: 0;' />



1. Увеличивается повторная информация; информация о пользователе повторяется в каждой строке.
2. Увеличено хранилище текста (текстовые байты больше целочисленных байтов)
3. Нет необходимости присоединяться!

Компромисс между нормализованными и денормализованными данными — это скорость и хранение. Хранение (по большей части) везде одинаково. Так что давайте сосредоточимся на скоростной стороне. Скорость разбивается на скорость чтения и скорость записи.

Из двух представлений данных:

1. Что, по нашему мнению, медленнее читать, но быстрее писать?
2. Что, по нашему мнению, медленнее писать, но быстрее читать?

<H2/>Немного истории

В начале 1970-х годов в одной из исследовательских
лабораторий компании IBM была разработана
экспериментальная реляционная СУБД IBM System R,
для которой был создан специальный язык SEQUEL,
позволявший управлять данными в этой CУБД.

Аббревиатура **SEQUEL** расшифровывалась как
Structured English Query Language —
«структурированный английский язык запросов».

Позже язык SEQUEL был переименован в **SQL**
(Structured Query Language)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/S30.png)

**С помощью чего можно выполнить SQL запрос**

Все современные СУБД содержат в своем
составе утилиты, позволяющие выполнить SQL
запрос и посмотреть его результат.
Например:
- Oracle содержит утилиту SQL Plus
-  Microsoft SQL Server - утилиту SQL Query
Analyzer

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s31.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s32.png)

**Синтаксис SQL**
SQL (язык структурированных запросов) — это язык запросов для загрузки, извлечения и обновления данных в реляционных базах данных. К наиболее часто используемым базам данных SQL относятся:

1. Oracle и MySQL
2. SQL Server
3. PostgreSQL

SQL-подобная структура также в значительной степени заимствована в крупномасштабных языках данных и платформах:

1. Apache Hive
2. Apache Drill (based on Google's Dremel)
3. Spark SQL

Поэтому важно изучить основы, которые подходят для всех платформ!

**Хороший синтаксис**

В то время как компании и команды данных в конечном итоге развивают свое собственное чувство стиля SQL, те, кто новичок в SQL, должны принять, по крайней мере, следующий стиль:

1. Ключевые слова написаны в верхнем регистре и начинаются с новых строк
2. поля в собственных строках
3. Продолжения имеют отступ

Это будет объяснено, когда мы рассмотрим примеры ниже. Чтобы помочь установить некоторые соединения, будут некоторые блоки кода Python, использующие синтаксис pandas для выполнения инструкций, аналогичных запросам SQL. Они будут помечены как панды и end_pandas, чтобы уточнить, где они находятся.

In [2]:
import pandas as pd
import sqlite3

<br>

https://ppt-online.org/938481

In [3]:
# install the ipython-sql libray
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.11/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (3.16.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (2.0.41)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.11/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.2.3)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.11/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.14.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (75.2.0)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: decorator in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (3.0.51)
Requirement already satisfied: pygments in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: backcall in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.11/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.11/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.11/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [4]:
df= pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'],
                  'age': [23,34,43],
                  'city': ['Miami', 'Buenos Aires','Santiago']})

df

       name  age          city
0      Juan   23         Miami
1  Victoria   34  Buenos Aires
2      Mary   43      Santiago

In [5]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [6]:
%load_ext sql

In [7]:
df.to_sql('people', cnn)

3

In [8]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [9]:
%sql sqlite:///jupyter_sql_tutorial.db



![image.png](https://raw.githubusercontent.com/trisha00001/file/main/S1.png)

In [10]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago')]

In [11]:

%%sql
SELECT name
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Juan',), ('Victoria',), ('Mary',)]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s17.png)

In [12]:

%%sql
SELECT name as 'Имя'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Juan',), ('Victoria',), ('Mary',)]

In [13]:
%%sql
SELECT name as 'Имя',age as 'Возраст'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Juan', 23), ('Victoria', 34), ('Mary', 43)]

#### ВЫБИРАТЬ
Базовый вариант использования для извлечения данных из базы данных..

```SQL
SELECT
    col1,
    col2
FROM table
WHERE [some condition];
```

Example
```SQL
SELECT
    poll_title,
    poll_date
FROM polls
WHERE romney_pct > obama_pct;
```

***pandas***
```python
polls[polls.romney_pct > polls.obama_pct][['poll_title', 'poll_date']]
```
***end_pandas***


Примечания:

1. WHERE является необязательным, хотя в конечном итоге фильтрация данных обычно является точкой запроса из базы данных.
2. Вы можете ВЫБРАТЬ столько столбцов, сколько захотите, и псевдоним каждого.

# Where проверка условия

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s3.png)

![image-2.png](https://raw.githubusercontent.com/trisha00001/file/main/s4.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s6.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s7.png)

In [14]:
%%sql
SELECT *
FROM people
WHERE age <= 35

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'), (1, 'Victoria', 34, 'Buenos Aires')]

Выбрать строки, где город указан как Buenos Aires

In [15]:
%%sql
SELECT *
FROM people
WHERE city == "Buenos Aires"

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Victoria', 34, 'Buenos Aires')]

Выбрать людей младше 40  не из города майами

In [16]:
%%sql
SELECT *
FROM people
WHERE age <= 40 AND city != "Miami"

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Victoria', 34, 'Buenos Aires')]

Вывести людей из города Miami

In [17]:
%%sql
SELECT *
FROM people
WHERE city = "Miami"

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami')]

Вывести людей не из Santiago

In [18]:
%%sql
SELECT *
FROM people
WHERE  not city = 'Santiago'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'), (1, 'Victoria', 34, 'Buenos Aires')]

In [19]:
Вывести людей из Santiago  или Miami

SyntaxError: invalid syntax (ipython-input-19-2930970392.py, line 1)

In [20]:
%%sql
SELECT *
FROM people
WHERE   city == 'Santiago' or city == 'Miami'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'), (2, 'Mary', 43, 'Santiago')]

In [21]:
%%sql
SELECT * FROM people
WHERE   age>= 25 and age<= 35

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Victoria', 34, 'Buenos Aires')]

![image-2.png](https://raw.githubusercontent.com/trisha00001/file/main/s8.png)

In [22]:
%%sql
SELECT name FROM people
ORDER BY name;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Juan',), ('Mary',), ('Victoria',)]

In [23]:
%%sql
SELECT * FROM people
ORDER BY name DESC;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (0, 'Juan', 23, 'Miami')]

Вывести людей из Santiago старше 40

In [24]:
%%sql
SELECT name, age
FROM people
Where age>= 25
ORDER BY name ;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Mary', 43), ('Victoria', 34)]

In [25]:
%%sql
SELECT *
FROM people
WHERE   city = 'Santiago' or city = 'Miami'
ORDER BY name DESC;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(2, 'Mary', 43, 'Santiago'), (0, 'Juan', 23, 'Miami')]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s9.png)

In [26]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago')]

In [27]:
%%sql
SELECT age FROM people
LIMIT 2

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(23,), (34,)]

<br>

<br>


# Агрегированные функции/

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s10.png)

In [28]:
%%sql
SELECT max(age)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(43,)]

In [29]:
%%sql
SELECT min(age)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(23,)]

In [30]:
%%sql
SELECT max(age), min(age)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(43, 23)]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s11.png)

In [31]:
%%sql
SELECT count(*)
FROM people
Where age >25

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(2,)]

In [32]:
%%sql
SELECT count(*)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [33]:
%%sql
SELECT avg(age)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(33.333333333333336,)]

In [34]:
%%sql
SELECT sum(age)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(100,)]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s33.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s37.png)

In [35]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago')]

In [36]:
%%sql
INSERT INTO people
VALUES (3,'Martin', 40,'Buenos Aires');

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [37]:
%%sql
INSERT INTO people
VALUES (4,'Mark', 25,'Buenos Aires');

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [38]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires')]

In [39]:
%%sql
SELECT avg(age)
FROM people
WHERE   city == 'Buenos Aires'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(33.0,)]

In [40]:
(34+40+25)/3

33.0

In [41]:
%%sql
INSERT INTO people
VALUES (5,'Marina', 43,'Sanremo');

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s34.png)

In [42]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (5, 'Marina', 43, 'Sanremo')]

In [43]:
%%sql
DELETE FROM people WHERE name='Marina';

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [44]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires')]

In [45]:
%%sql
INSERT INTO people
VALUES (25,'Av', 14,'Sanremo');
INSERT INTO people
VALUES (25,'LAvi', 24,'Sanremo');

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.
1 rows affected.

[]

In [46]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'Av', 14, 'Sanremo'),
 (25, 'LAvi', 24, 'Sanremo')]

In [47]:
%%sql
DELETE FROM people WHERE name=='Av';

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [48]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'LAvi', 24, 'Sanremo')]

In [49]:
%%sql
SELECT COUNT(city)
FROM people
Where city =="Buenos Aires"

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s13.png)

![image-2.png](https://raw.githubusercontent.com/trisha00001/file/main/s19.png)

In [50]:
%%sql
SELECT city,name
FROM people
WHERE name LIKE 'M%'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Santiago', 'Mary'), ('Buenos Aires', 'Martin'), ('Buenos Aires', 'Mark')]

In [51]:
%%sql
SELECT city,name
FROM people
WHERE name  LIKE '__r%'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Santiago', 'Mary'), ('Buenos Aires', 'Martin'), ('Buenos Aires', 'Mark')]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s15.png)

In [52]:
%%sql
SELECT *
FROM people
WHERE name IN ('Mary', 'Martin');

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(2, 'Mary', 43, 'Santiago'), (3, 'Martin', 40, 'Buenos Aires')]

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s16.png)

In [53]:
%%sql
SELECT *
FROM people
WHERE age BETWEEN 25 AND 40

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Victoria', 34, 'Buenos Aires'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires')]

In [54]:
%%sql
SELECT name as 'Имя', age as 'Возраст'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Juan', 23),
 ('Victoria', 34),
 ('Mary', 43),
 ('Martin', 40),
 ('Mark', 25),
 ('LAvi', 24)]

In [55]:
%%sql
CREATE TABLE zarp
(
    key      integer,
    name  varchar(6),
    price     float
);

 * sqlite:///jupyter_sql_tutorial.db
Done.

[]

In [56]:
%%sql
INSERT INTO zarp
VALUES (1,'Mark', 14.08);

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [57]:
%%sql
INSERT INTO zarp
VALUES (2,'LAvi', 24.90);

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [58]:
%%sql
select * from zarp

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Mark', 14.08), (2, 'LAvi', 24.9)]

In [59]:
%%sql
INSERT INTO zarp
VALUES (9,'Av', 50.90);

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [60]:
%%sql
Select *
from zarp

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Mark', 14.08), (2, 'LAvi', 24.9), (9, 'Av', 50.9)]

In [61]:
%%sql
Select *
from people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'LAvi', 24, 'Sanremo')]

In [62]:
%%sql
Select *
from zarp

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Mark', 14.08), (2, 'LAvi', 24.9), (9, 'Av', 50.9)]

<H2/>JOIN

JOIN-соединения – операции
горизонтального соединения данных.

Cуть операции объединения - склеить
разбитые по таблицам данные ,т.е.
привести их обратно в человеческий вид.
JOIN объединяет строки из двух или более
таблиц, на основе связи между ними (ключей).

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s18.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/S20.png)

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/S21.png)

In [63]:
%%sql
Select Distinct*
from zarp
INNER Join people on zarp.name = people.name

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Mark', 14.08, 4, 'Mark', 25, 'Buenos Aires'),
 (2, 'LAvi', 24.9, 25, 'LAvi', 24, 'Sanremo')]

![image.png](https://github.com/trisha00001/file/blob/main/S22.png?raw=true))

![image.png](https://github.com/trisha00001/file/blob/main/S23.png?raw=true))

In [64]:
%%sql
Select Distinct*
from zarp
Left Join people on zarp.name = people.name

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Mark', 14.08, 4, 'Mark', 25, 'Buenos Aires'),
 (2, 'LAvi', 24.9, 25, 'LAvi', 24, 'Sanremo'),
 (9, 'Av', 50.9, None, None, None, None)]

![image.png](https://github.com/trisha00001/file/blob/main/S24.png?raw=true))

![image.png](https://github.com/trisha00001/file/blob/main/S25.png?raw=true)

In [65]:
%%sql
Select Distinct*
from zarp
Right Join people on zarp.name = people.name

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: Select Distinct*
from zarp
Right Join people on zarp.name = people.name]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [66]:
%%sql
Select Distinct*
from people
Left Join zarp on people.name = zarp.name

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami', None, None, None),
 (1, 'Victoria', 34, 'Buenos Aires', None, None, None),
 (2, 'Mary', 43, 'Santiago', None, None, None),
 (3, 'Martin', 40, 'Buenos Aires', None, None, None),
 (4, 'Mark', 25, 'Buenos Aires', 1, 'Mark', 14.08),
 (25, 'LAvi', 24, 'Sanremo', 2, 'LAvi', 24.9)]

#### Соединения

JOIN широко используется в нормализованных данных для того, чтобы мы могли денормализовать информацию. Аналитики, которые работают в сильных реляционных базах данных, часто имеют полдюжины соединений в своих запросах.



```SQL
SELECT ...
FROM orders
INNER JOIN order_amounts a on a.order_id = orders.id
INNER JOIN order_items i on i.order_id = orders.id
INNER JOIN variants v on v.id = i.variant_id
INNER JOIN products p on p.id = v.product_id
INNER JOIN suppliers s on s.id = v.supplier_id
INNER JOIN addresses ad on ad.addressable_type = 'Supplier' and ad.addressable_id = s.id
...;
```

Basic Example:

```SQL
SELECT
    t1.c1,
    t1.c2,
    t2.c2
FROM t1
INNER JOIN t2 ON t1.c1 = t2.c2;
```

***pandas***
```python
t1.join(t2, on='c2')
```
***end_pandas***


There are several join types used, despite the above only using one: `INNER JOIN`.

<img src='img/sql_join_venn.jpg' />

Note that using JOIN introduces potential change in our data context: One to Many and Many to Many relationships.

<img src='img/relationships.png'  style='width: 50%;'/>



#####Troubleshooting JOINs

Make sure that your results are as expected, so consider what the observation is (the row), and rule check other columns:

* is your expected unique column unique?
* Is there duplicate data elsewhere?

A common check to see if your data is not unique is throwing a HAVING clause in your JOIN.

<H1/> GROUP BY

Предложение GROUP BY используется для определения групп, к
которым могут применяться агрегатные функции
(COUNT, MIN, MAX, AVG и SUM).

Если Group by отсутствует, и используются агрегатные функции, то
все столбцы с именами, упомянутыми в SELECT, должны быть
включены в агрегатные функции, и эти функции будут применяться
ко всему набору строк. В противном случае все столбцы
списка SELECT, не вошедшие в агрегатные функции, должны быть
указаны в предложении GROUP BY. В результате чего все
выходные строки запроса разбиваются на группы, характеризуемые
одинаковыми комбинациями значений в этих столбцах. После чего к
каждой группе будут применены агрегатные функции.

Если при наличии предложения GROUP BY, в предложении
SELECT отсутствуют агрегатные функции, то запрос просто вернет
по одной строке из каждой группы..

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s35.png)

In [67]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'LAvi', 24, 'Sanremo')]

In [68]:
%%sql
SELECT city, count(city)
FROM people
Group by city
order by city

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Buenos Aires', 3), ('Miami', 1), ('Sanremo', 1), ('Santiago', 1)]

In [69]:
%%sql
SELECT city, count(city)
FROM people
Group by city
order by city DESC

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Santiago', 1), ('Sanremo', 1), ('Miami', 1), ('Buenos Aires', 3)]

#### Агрегация и  GROUP BY
В этом стиле SELECT столбцы либо группируются по ключам, либо по агрегатам.



```SQL
SELECT
    col1,
    AVG(col2)
FROM table
GROUP BY col1;
```

Пример
```SQL
SELECT
    poll_date,
    AVG(obama_pct)
FROM polls
GROUP BY poll_date;
```

***pandas***
```python
polls.groupby('poll_date').obama_pct.mean()
```
***end_pandas***

Примечания:

1. Вы можете группировать и агрегировать столько столбцов, сколько захотите.
2. Поля, которые НЕ используют агрегаты, должны находиться в группе by. Некоторые базы данных SQL выдают ошибки; другие дадут вам неправильные данные.
3. Стандартные агрегаты включают : в основном агрегации, которые могут быть быстро решены. Например, реже является функцией, так как решение сложнее в SQL.STDDEV, MIN, MAX, COUNT, SUMMEDIAN

Вопросы:

1. Представьте себе поле poll_state. Как бы мы нашли максимальную obama_pct и romney_pct для каждого штата?
2. Как бы мы вернули подсчет опросов по штатам и датам?

![image.png](https://raw.githubusercontent.com/trisha00001/file/main/s36.png)

In [70]:
%%sql
SELECT city, count(city)
FROM people
Group by city
Having count(city)>2
order by count(city)

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Buenos Aires', 3)]

#### HAVING
Whereas WHERE is used for precomputation, HAVING is a postcomputation clause, filtering the data after the database engine has done the query's work.

```SQL
SELECT
    t1.c1,
    t1.c2,
    AVG(t2.c2)
FROM t1
INNER JOIN t2 ON t1.c1 = t2.c2
GROUP BY t1.c1, t1.c2
HAVING AVG(t2.c2) > 10;
```

```SQL
SELECT
    poll_date,
    AVG(obama_pct)
FROM polls
GROUP BY poll_date
HAVING AVG(obama_pct) > 50;
```

***pandas***
```python
polls_group = polls.groupby('poll_date').obama_pct.filter(lambda x: x.mean() > 50)
```
***end_pandas***


Note in this context HAVING allows us to filter on the computed column `AVG(t2.c2)` after the GROUP BY has run.

In [71]:
cnn.close()

Пример выгрузки в пандас

In [72]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [73]:
cur = cnn.cursor()

In [74]:
cur.execute('SELECT * FROM people')
cur.fetchall()

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'LAvi', 24, 'Sanremo')]

In [75]:
cur.execute('SELECT * FROM people')
cur.fetchall()

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aires'),
 (2, 'Mary', 43, 'Santiago'),
 (3, 'Martin', 40, 'Buenos Aires'),
 (4, 'Mark', 25, 'Buenos Aires'),
 (25, 'LAvi', 24, 'Sanremo')]

In [76]:
cnn.close()

In [77]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [78]:
df = pd.read_sql_query("SELECT * from people", cnn)

In [79]:
df

   index      name  age          city
0      0      Juan   23         Miami
1      1  Victoria   34  Buenos Aires
2      2      Mary   43      Santiago
3      3    Martin   40  Buenos Aires
4      4      Mark   25  Buenos Aires
5     25      LAvi   24       Sanremo

In [80]:
surveys2002 = df[df.age == 43]
surveys2002

   index  name  age      city
2      2  Mary   43  Santiago

In [81]:
cnn.close()

In [82]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [83]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('people',), ('zarp',)]

In [84]:
cnn.close()